PeleAB/STM32N6-FaceRecognition/STM32Cube_FW_N6/Middlewares/Third_Party/VideoEncoder/inc/reg_offset_v7.h
/*
 * Copyright (c) 2015-2022, Verisilicon Inc. - All Rights Reserved
 * Copyright (c) 2011-2014, Google Inc. - All Rights Reserved
 *
 *
 ********************************************************************************
 *
 * This software is distributed under the terms of
 * BSD-3-Clause. The following provisions apply :
 *
 ********************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************
 *
 *  Abstract : Register offset auto generated.
 *
 ********************************************************************************
 */

#ifndef __HENC_REGISTER_OFFSET_H__
#define __HENC_REGISTER_OFFSET_H__

/* IRQ Source Map. */
#define BASE_HEncIRQ 0x4U


/* HW synthesis config register 2, read-only */
#define BASE_HWFuse2 0x4a0U

/* HEncMBRC Control */
#define BASE_HEncMBRC 0x4a4U

/* Segment 4 */
#define BASE_HEncSeg4_1 0x4a8U
#define BASE_HEncSeg4_2 0x4acU
#define BASE_HEncSeg4_3 0x4b0U
#define BASE_HEncSeg4_4 0x4b4U

/* Segment 5 */
#define BASE_HEncSeg5_1 0x4b8U
#define BASE_HEncSeg5_2 0x4bcU
#define BASE_HEncSeg5_3 0x4c0U
#define BASE_HEncSeg5_4 0x4c4U

/* Segment 6 */
#define BASE_HEncSeg6_1 0x4c8U
#define BASE_HEncSeg6_2 0x4ccU
#define BASE_HEncSeg6_3 0x4d0U
#define BASE_HEncSeg6_4 0x4d4U

/* Segment 7 */
#define BASE_HEncSeg7_1 0x4d8U
#define BASE_HEncSeg7_2 0x4dcU
#define BASE_HEncSeg7_3 0x4e0U
#define BASE_HEncSeg7_4 0x4e4U

/* Segment 8 */
#define BASE_HEncSeg8_1 0x4e8U
#define BASE_HEncSeg8_2 0x4ecU
#define BASE_HEncSeg8_3 0x4f0U
#define BASE_HEncSeg8_4 0x4f4U

/* Segment 9 */
#define BASE_HEncSeg9_1 0x4f8U
#define BASE_HEncSeg9_2 0x4fcU
#define BASE_HEncSeg9_3 0x500U
#define BASE_HEncSeg9_4 0x504U

/* Segment 10 */
#define BASE_HEncSeg10_1 0x508U
#define BASE_HEncSeg10_2 0x50cU
#define BASE_HEncSeg10_3 0x510U
#define BASE_HEncSeg10_4 0x514U

/* Segment 11 */
#define BASE_HEncSeg11_1 0x518U
#define BASE_HEncSeg11_2 0x51cU
#define BASE_HEncSeg11_3 0x520U
#define BASE_HEncSeg11_4 0x524U

/* Segment 12 */
#define BASE_HEncSeg12_1 0x528U
#define BASE_HEncSeg12_2 0x52cU
#define BASE_HEncSeg12_3 0x530U
#define BASE_HEncSeg12_4 0x534U

/* Segment 13 */
#define BASE_HEncSeg13_1 0x538U
#define BASE_HEncSeg13_2 0x53cU
#define BASE_HEncSeg13_3 0x540U
#define BASE_HEncSeg13_4 0x544U

/* Segment 14 */
#define BASE_HEncSeg14_1 0x548U
#define BASE_HEncSeg14_2 0x54cU
#define BASE_HEncSeg14_3 0x550U
#define BASE_HEncSeg14_4 0x554U

/* Segment 15 */
#define BASE_HEncSeg15_1 0x558U
#define BASE_HEncSeg15_2 0x55cU
#define BASE_HEncSeg15_3 0x560U
#define BASE_HEncSeg15_4 0x564U

/* Segment 16 */
#define BASE_HEncSeg16_1 0x568U
#define BASE_HEncSeg16_2 0x56cU
#define BASE_HEncSeg16_3 0x570U
#define BASE_HEncSeg16_4 0x574U

/* Segment 17 */
#define BASE_HEncSeg17_1 0x578U
#define BASE_HEncSeg17_2 0x57cU
#define BASE_HEncSeg17_3 0x580U
#define BASE_HEncSeg17_4 0x584U

/* Segment 18 */
#define BASE_HEncSeg18_1 0x588U
#define BASE_HEncSeg18_2 0x58cU
#define BASE_HEncSeg18_3 0x590U
#define BASE_HEncSeg18_4 0x594U

/* Segment 19 */
#define BASE_HEncSeg19_1 0x598U
#define BASE_HEncSeg19_2 0x59cU
#define BASE_HEncSeg19_3 0x5a0U
#define BASE_HEncSeg19_4 0x5a4U

/* Segment 20 */
#define BASE_HEncSeg20_1 0x5a8U
#define BASE_HEncSeg20_2 0x5acU
#define BASE_HEncSeg20_3 0x5b0U
#define BASE_HEncSeg20_4 0x5b4U

/* Segment 21 */
#define BASE_HEncSeg21_1 0x5b8U
#define BASE_HEncSeg21_2 0x5bcU
#define BASE_HEncSeg21_3 0x5c0U
#define BASE_HEncSeg21_4 0x5c4U

/* Segment 22 */
#define BASE_HEncSeg22_1 0x5c8U
#define BASE_HEncSeg22_2 0x5ccU
#define BASE_HEncSeg22_3 0x5d0U
#define BASE_HEncSeg22_4 0x5d4U

/* Segment 23 */
#define BASE_HEncSeg23_1 0x5d8U
#define BASE_HEncSeg23_2 0x5dcU
#define BASE_HEncSeg23_3 0x5e0U
#define BASE_HEncSeg23_4 0x5e4U

/* Segment 24 */
#define BASE_HEncSeg24_1 0x5e8U
#define BASE_HEncSeg24_2 0x5ecU
#define BASE_HEncSeg24_3 0x5f0U
#define BASE_HEncSeg24_4 0x5f4U

/* Segment 25 */
#define BASE_HEncSeg25_1 0x5f8U
#define BASE_HEncSeg25_2 0x5fcU
#define BASE_HEncSeg25_3 0x600U
#define BASE_HEncSeg25_4 0x604U

/* Segment 26 */
#define BASE_HEncSeg26_1 0x608U
#define BASE_HEncSeg26_2 0x60cU
#define BASE_HEncSeg26_3 0x610U
#define BASE_HEncSeg26_4 0x614U

/* Segment 27 */
#define BASE_HEncSeg27_1 0x618U
#define BASE_HEncSeg27_2 0x61cU
#define BASE_HEncSeg27_3 0x620U
#define BASE_HEncSeg27_4 0x624U

/* Segment 28 */
#define BASE_HEncSeg28_1 0x628U
#define BASE_HEncSeg28_2 0x62cU
#define BASE_HEncSeg28_3 0x630U
#define BASE_HEncSeg28_4 0x634U

/* Segment 29 */
#define BASE_HEncSeg29_1 0x638U
#define BASE_HEncSeg29_2 0x63cU
#define BASE_HEncSeg29_3 0x640U
#define BASE_HEncSeg29_4 0x644U

/* Segment 30 */
#define BASE_HEncSeg30_1 0x648U
#define BASE_HEncSeg30_2 0x64cU
#define BASE_HEncSeg30_3 0x650U
#define BASE_HEncSeg30_4 0x654U

/* Segment 31 */
#define BASE_HEncSeg31_1 0x658U
#define BASE_HEncSeg31_2 0x65cU
#define BASE_HEncSeg31_3 0x660U
#define BASE_HEncSeg31_4 0x664U

/* MBRC Control registers */
#define BASE_HEncMBRcControl 0x668U
#define BASE_HEncMBQpDeltaGain 0x66cU

/* HEncMBComplexity */
#define BASE_HEncMBComplexity 0x670U

/* Reference Frame Compression */
#define BASE_HEncRfcControl 0x674U
#define BASE_HEncBaseRefLumTbl 0x678U
#define BASE_HEncBaseRefChrTbl 0x67cU
#define BASE_HEncBaseRecLumTbl 0x680U
#define BASE_HEncBaseRecChrTbl 0x684U
#define BASE_HEncBaseRefLumTbl2 0x688U
#define BASE_HEncBaseRefChrTbl2 0x68cU
#define BASE_HEncRfcChrBufLimit 0x690U

/* Reference Management Commands */
#define BASE_HEncRefReorderCmd 0x694U

/* AXI Read ID for Input */
#define BASE_HEncInputAxiId 0x698U

/* MSB for 64bit address access. */
#define BASE_HEncBaseRefLumTblMSB 0x69cU
#define BASE_HEncBaseRefChrTblMSB 0x6a0U
#define BASE_HEncBaseRecLumTblMSB 0x6a4U
#define BASE_HEncBaseRecChrTblMSB 0x6a8U
#define BASE_HEncBaseRefLumTbl2MSB 0x6acU
#define BASE_HEncBaseRefChrTbl2MSB 0x6b0U
#define BASE_HEncBaseStream_MSB 0x6b4U
#define BASE_HEncBaseControl_MSB 0x6b8U
#define BASE_HEncBaseRefLum_MSB 0x6bcU
#define BASE_HEncBaseRefChr_MSB 0x6c0U
#define BASE_HEncBaseRecLum_MSB 0x6c4U
#define BASE_HEncBaseRecChr_MSB 0x6c8U
#define BASE_HEncBaseInLum_MSB 0x6ccU
#define BASE_HEncBaseInCb_MSB 0x6d0U
#define BASE_HEncBaseInCr_MSB 0x6d4U
#define BASE_HEncBaseRefLum2_MSB 0x6d8U
#define BASE_HEncBaseRefChr2_MSB 0x6dcU
#define BASE_HEncH264BaseRefLum2_MSB 0x6e0U
#define BASE_HEncH264BaseRefChr2_MSB 0x6e4U
#define BASE_HEncBaseNextLum_MSB 0x6e8U
#define BASE_HEncBaseCabacCtx_MSB 0x6ecU
#define BASE_HEncBaseMvWrite_MSB 0x6f0U
#define BASE_HEncBasePartition1_MSB 0x6f4U
#define BASE_HEncBasePartition2_MSB 0x6f8U
#define BASE_HEncBaseVp8ProbCount_MSB 0x6fcU
#define BASE_HEncBaseVp8SegmentMap_MSB 0x700U
#define BASE_HEncBaseScaledOutLum_MSB 0x704U
#define BASE_HEncBasePartition3_MSB 0x708U
#define BASE_HEncBasePartition4_MSB 0x70cU

/* Denoise Filter Control. */
#define BASE_HEncDnfControl 0x710U
#define BASE_HEncDnfNoiseMax 0x714U
#define BASE_HEncDnfNoiseLevel 0x718U
#define BASE_HEncDnfNoisePred 0x71cU
#define BASE_HEncDnfThresholdPred 0x720U

/* Denoise Filter Parameters. */
#define BASE_HEncDnfParaS1G1 0x724U
#define BASE_HEncDnfParaS1G2 0x728U
#define BASE_HEncDnfParaS1G3 0x72cU
#define BASE_HEncDnfParaS1G4 0x730U
#define BASE_HEncDnfParaS2G1 0x734U
#define BASE_HEncDnfParaS2G2 0x738U
#define BASE_HEncDnfParaS2G3 0x73cU
#define BASE_HEncDnfParaS2G4 0x740U
#define BASE_HEncDnfParaS3G1 0x744U
#define BASE_HEncDnfParaS3G2 0x748U
#define BASE_HEncDnfParaS3G3 0x74cU
#define BASE_HEncDnfParaS3G4 0x750U
#define BASE_HEncDnfParaS3G5 0x754U
#define BASE_HEncDnfParaS3G6 0x758U
#define BASE_HEncDnfParaS3G7 0x75cU
#define BASE_HEncDnfParaS3G8 0x760U
#define BASE_HEncDnfParaS3G9 0x764U
#define BASE_HEncDnfParaS3G10 0x768U
#define BASE_HEncDnfParaS3G11 0x76cU
#define BASE_HEncDnfParaS3G12 0x770U
#define BASE_HEncDnfParaS3G13 0x774U
#define BASE_HEncDnfParaS3G14 0x778U
#define BASE_HEncDnfParaS3G15 0x77cU
#define BASE_HEncDnfParaS3G16 0x780U
#define BASE_HEncDnfParaS4G1 0x784U
#define BASE_HEncDnfParaS4G2 0x788U
#define BASE_HEncDnfParaS4G3 0x78cU
#define BASE_HEncDnfParaS4G4 0x790U
#define BASE_HEncDnfParaS4G5 0x794U
#define BASE_HEncDnfParaS4G6 0x798U
#define BASE_HEncDnfParaS4G7 0x79cU
#define BASE_HEncDnfParaS4G8 0x7a0U
#define BASE_HEncDnfParaS4G9 0x7a4U
#define BASE_HEncDnfParaS4G10 0x7a8U
#define BASE_HEncDnfParaS4G11 0x7acU
#define BASE_HEncDnfParaS4G12 0x7b0U
#define BASE_HEncDnfParaS4G13 0x7b4U
#define BASE_HEncDnfParaS4G14 0x7b8U
#define BASE_HEncDnfParaS4G15 0x7bcU
#define BASE_HEncDnfParaS4G16 0x7c0U

/* Low latency and Input Line buffer. */
#define BASE_HEncInstantInput 0x7c4U

/* Last Fake Register for Register Counting. */
#define BASE_HEncRegisterMax 0x7c8U

#endif /* __HENC_REGISTER_OFFSET_H__ */

